Revit 2024 API
ExternalResourceMatchOptions Constructor
 Constructs new instance with specified resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceMatchOptions(
	ExternalResourceType resourceType
)
Visual Basic
Public Sub New ( _
	resourceType As ExternalResourceType _
)
Visual C++
public:
ExternalResourceMatchOptions(
	ExternalResourceType^ resourceType
)
Parameters
resourceType
Type: Autodesk.Revit.DB.ExternalResourceType
 The desired resource type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace